app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."start_date" BETWEEN ? AND ?  [["start_date", "2019-03-10"], ["start_date", "2019-04-10"]]
---
  def upcoming_events
      @events = Event.where(start_date: DateTime.now.prev_month(3)..DateTime.now)