app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2019-04-10 13:57:10.238646"], ["updated_at", "2019-04-10 13:57:10.238646"]]
---
  def create
    @order = Order.new(order_params)
    #@order.user_id = 2

    respond_to do |format|
      if @order.save