app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ?  [["ticket_type_id", 1]]
---
  def index
    if params[:ticket_type_id].nil?
      @tickets = Ticket.all
    else
      @tickets_filtered = Ticket.where(ticket_type_id: TicketType.find(params[:ticket_type_id]).id)

INSERT INTO "tickets" ("ticket_type_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ticket_type_id", 1], ["order_id", 1], ["created_at", "2019-04-10 14:01:43.876249"], ["updated_at", "2019-04-10 14:01:43.876249"]]
---
  def create
    @ticket = Ticket.new(ticket_params)
    #@ticket.ticket_type_id = 1
    #@ticket.order_id = 1

    respond_to do |format|
      if @ticket.save

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_ticket
      @ticket = Ticket.find(params[:id])