app/controllers/ticket_types_controller.rb

  def index
    @ticket_types = TicketType.all
---
SELECT "ticket_types".* FROM "ticket_types"

  def create
    @ticket_type = TicketType.new(ticket_type_params)
    @ticket_type.ticket_zone_id = 1
    @ticket_type.event_id = 1

    respond_to do |format|
      if @ticket_type.save
---
INSERT INTO "ticket_types" ("event_id", "ticket_zone_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["event_id", 1], ["ticket_zone_id", 1], ["created_at", "2019-04-10 13:52:38.445946"], ["updated_at", "2019-04-10 13:52:38.445946"]]

    def set_ticket_type
      @ticket_type = TicketType.find(params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]