app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-04-10 20:49:39.616762"], ["updated_at", "2019-04-10 20:49:39.616762"]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save